dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S29WOP */
#define IFX_DMU_HP_PROCON_WOP0_S29WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S29WOP */
#define IFX_DMU_HP_PROCON_WOP0_S29WOP_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S30WOP */
#define IFX_DMU_HP_PROCON_WOP0_S30WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S30WOP */
#define IFX_DMU_HP_PROCON_WOP0_S30WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S30WOP */
#define IFX_DMU_HP_PROCON_WOP0_S30WOP_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S31WOP */
#define IFX_DMU_HP_PROCON_WOP0_S31WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S31WOP */
#define IFX_DMU_HP_PROCON_WOP0_S31WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S31WOP */
#define IFX_DMU_HP_PROCON_WOP0_S31WOP_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S32WOP */
#define IFX_DMU_HP_PROCON_WOP1_S32WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S32WOP */
#define IFX_DMU_HP_PROCON_WOP1_S32WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S32WOP */
#define IFX_DMU_HP_PROCON_WOP1_S32WOP_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S33WOP */
#define IFX_DMU_HP_PROCON_WOP1_S33WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S33WOP */
#define IFX_DMU_HP_PROCON_WOP1_S33WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S33WOP */
#define IFX_DMU_HP_PROCON_WOP1_S33WOP_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S34WOP */
#define IFX_DMU_HP_PROCON_WOP1_S34WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S34WOP */
#define IFX_DMU_HP_PROCON_WOP1_S34WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S34WOP */
#define IFX_DMU_HP_PROCON_WOP1_S34WOP_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S35WOP */
#define IFX_DMU_HP_PROCON_WOP1_S35WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S35WOP */
#define IFX_DMU_HP_PROCON_WOP1_S35WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S35WOP */
#define IFX_DMU_HP_PROCON_WOP1_S35WOP_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S36WOP */
#define IFX_DMU_HP_PROCON_WOP1_S36WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S36WOP */
#define IFX_DMU_HP_PROCON_WOP1_S36WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S36WOP */
#define IFX_DMU_HP_PROCON_WOP1_S36WOP_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S37WOP */
#define IFX_DMU_HP_PROCON_WOP1_S37WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S37WOP */
#define IFX_DMU_HP_PROCON_WOP1_S37WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S37WOP */
#define IFX_DMU_HP_PROCON_WOP1_S37WOP_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S38WOP */
#define IFX_DMU_HP_PROCON_WOP1_S38WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S38WOP */
#define IFX_DMU_HP_PROCON_WOP1_S38WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S38WOP */
#define IFX_DMU_HP_PROCON_WOP1_S38WOP_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S39WOP */
#define IFX_DMU_HP_PROCON_WOP1_S39WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S39WOP */
#define IFX_DMU_HP_PROCON_WOP1_S39WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S39WOP */
#define IFX_DMU_HP_PROCON_WOP1_S39WOP_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S40WOP */
#define IFX_DMU_HP_PROCON_WOP1_S40WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S40WOP */
#define IFX_DMU_HP_PROCON_WOP1_S40WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S40WOP */
#define IFX_DMU_HP_PROCON_WOP1_S40WOP_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S41WOP */
#define IFX_DMU_HP_PROCON_WOP1_S41WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S41WOP */
#define IFX_DMU_HP_PROCON_WOP1_S41WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S41WOP */
#define IFX_DMU_HP_PROCON_WOP1_S41WOP_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S42WOP */
#define IFX_DMU_HP_PROCON_WOP1_S42WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S42WOP */
#define IFX_DMU_HP_PROCON_WOP1_S42WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S42WOP */
#define IFX_DMU_HP_PROCON_WOP1_S42WOP_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S43WOP */
#define IFX_DMU_HP_PROCON_WOP1_S43WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S43WOP */
#define IFX_DMU_HP_PROCON_WOP1_S43WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S43WOP */
#define IFX_DMU_HP_PROCON_WOP1_S43WOP_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S44WOP */
#define IFX_DMU_HP_PROCON_WOP1_S44WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S44WOP */
#define IFX_DMU_HP_PROCON_WOP1_S44WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S44WOP */
#define IFX_DMU_HP_PROCON_WOP1_S44WOP_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S45WOP */
#define IFX_DMU_HP_PROCON_WOP1_S45WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S45WOP */
#define IFX_DMU_HP_PROCON_WOP1_S45WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S45WOP */
#define IFX_DMU_HP_PROCON_WOP1_S45WOP_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S46WOP */
#define IFX_DMU_HP_PROCON_WOP1_S46WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S46WOP */
#define IFX_DMU_HP_PROCON_WOP1_S46WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S46WOP */
#define IFX_DMU_HP_PROCON_WOP1_S46WOP_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S47WOP */
#define IFX_DMU_HP_PROCON_WOP1_S47WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S47WOP */
#define IFX_DMU_HP_PROCON_WOP1_S47WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S47WOP */
#define IFX_DMU_HP_PROCON_WOP1_S47WOP_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S48WOP */
#define IFX_DMU_HP_PROCON_WOP1_S48WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S48WOP */
#define IFX_DMU_HP_PROCON_WOP1_S48WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S48WOP */
#define IFX_DMU_HP_PROCON_WOP1_S48WOP_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S49WOP */
#define IFX_DMU_HP_PROCON_WOP1_S49WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S49WOP */
#define IFX_DMU_HP_PROCON_WOP1_S49WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S49WOP */
#define IFX_DMU_HP_PROCON_WOP1_S49WOP_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S50WOP */
#define IFX_DMU_HP_PROCON_WOP1_S50WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S50WOP */
#define IFX_DMU_HP_PROCON_WOP1_S50WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S50WOP */
#define IFX_DMU_HP_PROCON_WOP1_S50WOP_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S51WOP */
#define IFX_DMU_HP_PROCON_WOP1_S51WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S51WOP */
#define IFX_DMU_HP_PROCON_WOP1_S51WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S51WOP */
#define IFX_DMU_HP_PROCON_WOP1_S51WOP_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S52WOP */
#define IFX_DMU_HP_PROCON_WOP1_S52WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S52WOP */
#define IFX_DMU_HP_PROCON_WOP1_S52WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S52WOP */
#define IFX_DMU_HP_PROCON_WOP1_S52WOP_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S53WOP */
#define IFX_DMU_HP_PROCON_WOP1_S53WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S53WOP */
#define IFX_DMU_HP_PROCON_WOP1_S53WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S53WOP */
#define IFX_DMU_HP_PROCON_WOP1_S53WOP_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S54WOP */
#define IFX_DMU_HP_PROCON_WOP1_S54WOP_LEN (1u)

